Repository: Mattlk13/metacpan-cpan-extracted
Catalog: distros/R/RT-Extension-ImportCustomFieldValues/po/*.po
Languages: fr

source: %1: Wrong file format
fr: %1: mauvais format de fichier

source: - Column "Name" is mandatory, other columns may be empty but must exists
fr: - La colonne «Name» est obligatoire, les autre colonnes peuvent être vides mais doivent exister

source: - Fields separated by ";"
fr: - Champs séparés par «;»

source: - File encoding: UTF-8
fr: - Encodage du fichier: UTF-8

source: - No headers
fr: - Pas de ligne d'en-tête

source: - Using the following columns and order: SortOrder, Name, Description, Category
fr: - Utiliser les colonnes suivantes, dans l'order: SortOrder, Nom, Description, Catégorie

source: CSV file
fr: Fichier CSV

source: Cancel
fr: Annuler

source: Category
fr: Catégorie

source: Confirm
fr: Confirmer

source: CustomField not found
fr: Champs personalisé non trouvé

source: Default is to add CSV values to existing ones
fr: Par défaut les valeurs importées sont ajoutées aux valeurs existantes

source: Error deleting old value %1: %2
fr: Erreur lors de la suppression de l'ancienne valeur %1: %2

source: Import
fr: Importer

source: Import from CSV
fr: Importer depuis un CSV

source: Importing values for CustomField %1
fr: Importer des valeus pour le champs personnalisé %1

source: Line %1: "%2" must be numerical
fr: Ligne %1: «%2» doit être numérique

source: Line %1: import error: %2
fr: Ligne %1: erreur d'importation: %2

source: Line %1: missing "%2"
fr: Ligne %1: «%2» manquant

source: Line %1: successfully imported
fr: Ligne %1: importée avec succès

source: Name
fr: Nom

source: No permissions to edit this customfield values
fr: Vous n'avez pas la permission de modifier les valeurs de ce champs personnalisé

source: No values to import
fr: Aucune valeur à importer

source: Old value %1 deleted
fr: Ancienne valeur %1 supprimée

source: Please select a file with needed values using following format:
fr: Veuillez sélectionner un fichier avec le valeurs souhaitées, en utilisant le format:

source: Replace?
fr: Remplacer?

source: SortOrder
fr: Ordre de tri

source: The following values will be added to existing ones:
fr: Les valeurs suivantes vont être ajoutées aux valeurs existantes:

source: The following values will replace existing ones:
fr: Les valeurs suivantes vont remplacer les valeurs existantes:

source: Unable to read file
fr: Impossible de lire le fichier
