Repository: Mattlk13/metacpan-cpan-extracted
Catalog: distros/R/RT-Extension-TOTPMFA/po/*.po
Languages: fr

source: %1 digits or Yubikey OTP
fr: %1 chiffres ou Yubikey OTP

source: (seconds between MFA prompts)
fr: (secondes entre les demandes de MFA)

source: Check this box to confirm.
fr: Cochez cette case pour confirmer

source: Click here to show the reset button.
fr: Cliquez ici pour afficher le bouton de réinitialisation.

source: Click to view QR code
fr: Cliquez pour afficher le code QR

source: Confirmation not received - secret has not been reset.
fr: Confirmation non reçue - le secret n´a pas été réinitiallisé.

source: Enter a Yubikey OTP here to register the device
fr: Saisissez un OTP Yubikey ici pour enregistrer la clef

source: Error
fr: Erreur

source: If your TOTP app is lost or the QR code is exposed to others, you can generate a new TOTP secret below.
fr: Si votre application TOTP est perdue ou que votre code QR a été compromis, vous pouvez générer un nouveau secret TOTP ci-dessous.

source: Login
fr: Connexion

source: MFA validation duration
fr: Durée de validation du MFA

source: Multi-factor authentication
fr: Authentification multi-facteur

source: No TOTP secret registered
fr: Aucun secret TOTP enrgistré

source: No TOTPMFA settings key provided
fr: Pas de clef de configuration TOTPMFA fournie

source: No TOTPMFA settings value provided for key %1
fr: Pas de configuration TOTPMFA fournie pour la clef %1

source: No Yubikey device registered
fr: Aucune clef Yubikey enregistrée

source: Not enabled
fr: Désactivé

source: One-time passcode
fr: Code à usage unique

source: One-time passcode (OATH TOTP or Yubikey)
fr: Code à usage unique (OATH TOTP ou Yubikey)

source: One-time passcode does not match a known format.
fr: Le code ne correspond pas à un format connu.

source: One-time passcode does not match.
fr: Le code ne correspond pas.

source: One-time passcode is not from the registered Yubikey device.
fr: Le code ne provient pas de la clef Yubikey enregistrée.

source: One-time passcode validation API call failed
fr: Échec de validation du code lors de l´appel API

source: One-time passcode validation API call failed with this error: %1
fr: Échec de validation du code lors de l´appel API avec l´erreur: %1

source: One-time passcode validation failed with no valid status response
fr: Échec de validation du code avec un code de retour invalide

source: One-time passcode validation failed with this status response: %1
fr: Échec de validation du code avec le code de retour: %1

source: Register with TOTP app
fr: Enregistrer dans une application TOTP

source: Reset TOTP secret
fr: Réinitialiser le secret TOTP

source: Save Preferences
fr: Sauver les préférences

source: Test
fr: Tester

source: Test failed: %1
fr: Échec du test: %1

source: Test successful: One-time passcode accepted.
fr: Testé avec succès: code accepté.

source: This will invalidate any previously registered secret.
fr: Ceci invalidera tous secret précédemment enregistré.

source: To test your authenticator app without switching on multi-factor authentication, enter a one-time passcode from it here and click on the "Test" button.
fr: Pour test votre application sans basculer sur une authentification multi-facteur, saisissez le code à usag unituqe ici et cliques sur le bouton « Tester ».

source: Unknown TOTPMFA settings key: %1
fr: Clef de configuration TOTPMFA inconnue: %1

source: Updated TOTPMFA "%1" value.
fr: Valeur TOTPMFA « %1 » mise à jour.

source: Yubikey identifier
fr: Identifiant Yubikey
